{
    "_meta": {
        "sources": [
            {
                "json": "CotSR",
                "abbreviation": "CotSR",
                "full": "Circle of the Storm Rider",
                "version": "1.3",
                "url": "https://www.gmbinder.com/share/-NzJJ2pOpnnBzXizQj0U",
                "authors": [
                    "DM Oz"
                ],
                "convertedBy": [
                    "DM Oz"
                ],
                "color": "63acb6"
            }
        ],
        "optionalFeatureTypes": {
            "SRC": "Storm Rider Capability"
        }
    },
    "subclass": [
        {
            "name": "Circle of the Storm Rider",
            "shortName": "Storm Rider",
            "source": "CotSR",
            "className": "Druid",
            "classSource": "PHB",
            "subclassFeatures": [
                "Circle Spells|Druid||Storm Rider|CotSR|2",
                "Beast of the Ocean Surge|Druid||Storm Rider|CotSR|2",
                "Riding the Storm|Druid||Storm Rider|CotSR|2",
                "Beast of the Storm Cloud|Druid||Storm Rider|CotSR|6",
                "Beast of the Whirlwind|Druid||Storm Rider|CotSR|10",
                "Weather Resilience|Druid||Storm Rider|CotSR|14"
            ]
        }
    ],
    "optionalfeature": [
        {
            "name": "Unarmored Defense",
            "source": "CotSR",
            "isClassFeatureVariant": true,
            "featureType": [
                "SRC"
            ],
            "entries": [
                "While you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier. You may also add your Wisdom modifier to your beast form's AC while in Wild Shape, and you can choose to make a Wisdom saving throw to maintain concentration on spells when damaged in any unarmored, unshielded form rather than a Constitution saving throw.",
                "This capability is required for all 2nd-level Storm Rider druids; thereafter, this capability may be exchanged for another."
            ]
        },
        {
            "name": "Step of the Wind",
            "source": "CotSR",
            "isClassFeatureVariant": true,
            "featureType": [
                "SRC"
            ],
            "entries": [
                "You can expend any 1 spell slot to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn. When a creature you can see hits you with an attack roll before the start of your next turn, you can use your reaction to force that creature to reroll. You can use this bonus action and reaction while in beast form. You must not be wearing armor or wielding a shield to gain this benefit."
            ]
        },
        {
            "name": "Primal Ferocity",
            "source": "CotSR",
            "isClassFeatureVariant": true,
            "featureType": [
                "SRC"
            ],
            "entries": [
                "Once during the time you are in beast form, you can enter a rage as a bonus action. You cannot rage again until you expend another use of Wild Shape or finish a short or long rest.",
                "While raging, you gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "You have advantage on Strength checks and Strength saving throws.",
                        "When you make an attack other than a spell attack, you add your proficiency bonus to the damage roll.",
                        "You have resistance to bludgeoning, piercing, and slashing damage."
                    ]
                },
                "You can't cast or concentrate on spells while raging.",
                "Your rage lasts for 1 minute. It ends early if you transform or are knocked unconscious or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action."
            ]
        },
        {
            "name": "Strike of the Rolling Wave",
            "source": "CotSR",
            "isClassFeatureVariant": true,
            "featureType": [
                "SRC"
            ],
            "entries": [
                "While you are wearing no armor and not wielding a shield, you can roll a d4 in place of the normal damage of your unarmed strike or simple weapon. This die increases to a d6 at 5th level, d8 at 11th level, and a d10 at 17th. At 6th level your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to non-magical attacks and damage. {@b Multiclass:} You must have the required druid levels to gain these benefits.",
                "When you use the Attack action with an unarmed strike or a simple weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven't already taken a bonus action this turn.",
                "You can choose to make two unarmed strikes instead of one in your bonus action by expending any 1 spell slot.",
                "While in beast form, you may choose to use your unarmed damage die in place of one of the beast's available attacks that inflict bludgeoning, piercing, or slashing damage. For example, if the beast has a claw attack and a bite attack, you can elect to use your unarmed damage die in place of either the claw or bite damage, but not both. Your bonus action strikes for this form are the attack type you elected: claw or bite in this example. If a beast's attack does additional damage, such as poison damage, then that attack cannot be used as a bonus action strike."
            ]
        },
        {
            "name": "Evasive Speed",
            "source": "CotSR",
            "isClassFeatureVariant": true,
            "featureType": [
                "SRC"
            ],
            "entries": [
                "You gain lightning-fast reflexes, giving you an edge when you dodge away from danger. You have advantage on initiative rolls. Additionally, when you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, instead you can use your reaction to take no damage if you succeed on the saving throw, and only half damage if you fail. You can decide to use your reaction after you roll but before you know whether you succeed."
            ]
        },
        {
            "name": "Reckless Attack",
            "source": "CotSR",
            "isClassFeatureVariant": true,
            "featureType": [
                "SRC"
            ],
            "entries": [
                "You have beast form behavior as unpredictable as a raging storm. While in beast form, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee attack rolls during this turn, but attack rolls against you have advantage until your next turn. You cannot use this attack capability unless you are in your beast form."
            ]
        },
        {
            "name": "Deflect Missiles",
            "source": "CotSR",
            "isClassFeatureVariant": true,
            "featureType": [
                "SRC"
            ],
            "prerequisite": [
                {
                    "level": {
                        "level": 3,
                        "class": {
                            "name": "Druid"
                        }
                    }
                }
            ],
            "entries": [
                "You can use your reaction in any form to deflect the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your druid level (minimum 1). You must not be wearing armor nor wielding a shield, in order to reduce damage in this way."
            ]
        },
        {
            "name": "Favorable Wind",
            "source": "CotSR",
            "isClassFeatureVariant": true,
            "featureType": [
                "SRC"
            ],
            "prerequisite": [
                {
                    "level": {
                        "level": 4,
                        "class": {
                            "name": "Druid"
                        }
                    }
                }
            ],
            "entries": [
                "The air around you buffets you if you fall, reducing any falling damage you take by an amount equal to five times your druid level, even if you are incapacitated. No action is required on your part, as the environment responds to your fall automatically. Once you benefit from this damage reduction, you cannot benefit from it again until you have finished a long rest. You must be in beast form, or you must not be wearing armor nor wielding a shield, in order to reduce damage in this way."
            ]
        },
        {
            "name": "Swift Movement",
            "source": "CotSR",
            "isClassFeatureVariant": true,
            "featureType": [
                "SRC"
            ],
            "prerequisite": [
                {
                    "level": {
                        "level": 5,
                        "class": {
                            "name": "Druid"
                        }
                    }
                }
            ],
            "entries": [
                "Your speed increases by 10 feet while you are not wearing armor or wielding a shield. You may add your speed bonus to all speed types (walking, swimming, burrowing, etc.) of any beast you transform into."
            ]
        },
        {
            "name": "Stunning Circle Spell",
            "source": "CotSR",
            "isClassFeatureVariant": true,
            "featureType": [
                "SRC"
            ],
            "prerequisite": [
                {
                    "level": {
                        "level": 5,
                        "class": {
                            "name": "Druid"
                        }
                    }
                }
            ],
            "entries": [
                "When you hit another creature with an attack using the Circle Spell cantrip you chose at 2nd level, you can expend any 1 spell slot to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn. If the target is airborne or waterborne it makes its saving throw at a disadvantage. Any creature that succeeds its saving throw is immune to your stunning strike capability for 24 hours. {@b Storm Rider Adept feat:} This capability may only be gained with the Storm Rider Adept feat if you are a Circle of the Storm Rider Druid with 5 levels in the {@b druid} class."
            ]
        },
        {
            "name": "Command of the Elements",
            "source": "CotSR",
            "isClassFeatureVariant": true,
            "featureType": [
                "SRC"
            ],
            "prerequisite": [
                {
                    "level": {
                        "level": 5,
                        "class": {
                            "name": "Druid"
                        }
                    }
                }
            ],
            "entries": [
                "You always have the following spells prepared, which do not count against the maximum number of spells you can prepare: {@i thunderwave}, {@i gust of wind}, and {@i call lightning}.",
                "You may cast these spells while in beast form, and you can concentrate on {@i call lightning} and {@i gust of wind} simultaneously. If your concentration is broken, then both spells end. Your beast form can also breathe underwater even if it does not normally."
            ]
        },
        {
            "name": "Relentless Wild Shape",
            "source": "CotSR",
            "isClassFeatureVariant": true,
            "featureType": [
                "SRC"
            ],
            "prerequisite": [
                {
                    "level": {
                        "level": 11,
                        "class": {
                            "name": "Druid"
                        }
                    }
                }
            ],
            "entries": [
                "You can maintain your beast form despite grievous wounds. If you drop to 0 hit points while you're in beast form, you can make a saving throw as if you are concentrating on a spell against the damage you suffered. If you succeed, you drop to 1 hit point instead and remain in beast form.",
                "If you are concentrating on a spell, that spell ends automatically on your attempt to remain in beast form."
            ]
        }
    ],
    "subclassFeature": [
        {
            "name": "Circle of the Storm Rider",
            "source": "CotSR",
            "className": "Druid",
            "classSource": "PHB",
            "subclassShortName": "Storm Rider",
            "subclassSource": "CotSR",
            "level": 2,
            "entries": [
                "As they communed with nature, these Druids harnessed the fury of the barbarian and the serene calm of the monk, seamlessly transitioning between states of primal rage and tranquil meditation. As seafaring folk, the discipline of a ship’s crew is most urgent in the face of a freezing ocean gale, and yet druids also learn that that same power can be harnessed by unleashing the storm within. Each strives to achieve their innate “horizon”, the world-surrounding edge where sky, peace, and life meet sea, turmoil, and death. The horizon is the birthplace of typhoons and tsunamis, with sky their mother and sea their father, and as children of the horizon they believe its untapped power resides inside us all.",
                {
                    "type": "refSubclassFeature",
                    "subclassFeature": "Circle Spells|Druid||Storm Rider|CotSR|2"
                },
                {
                    "type": "refSubclassFeature",
                    "subclassFeature": "Beast of the Ocean Surge|Druid||Storm Rider|CotSR|2"
                },
                {
                    "type": "refSubclassFeature",
                    "subclassFeature": "Riding the Storm|Druid||Storm Rider|CotSR|2"
                }
            ]
        },
        {
            "name": "Circle Spells",
            "source": "CotSR",
            "className": "Druid",
            "classSource": "PHB",
            "subclassShortName": "Storm Rider",
            "subclassSource": "CotSR",
            "level": 2,
            "header": 1,
            "entries": [
                "When you choose this circle at 2nd level, you gain one extra cantrip as a Circle Spell from the following options: improved shillelagh (see below), eldritch blast, ray of frost, or shocking grasp. If you already know the chosen cantrip, you learn a different cantrip of your choice from the list of druid cantrips. The cantrip doesn't count against your number of cantrips known, but the cantrip is a druid cantrip for you even if it is normally unavailable to druids.",
                "When you gain new cantrips at higher levels, your options include the cantrips listed above.",
                "Improved shillelagh is identical to the cantrip shillelagh with the exception that the spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8)."
            ]
        },
        {
            "name": "Beast of the Ocean Surge",
            "source": "CotSR",
            "className": "Druid",
            "classSource": "PHB",
            "subclassShortName": "Storm Rider",
            "subclassSource": "CotSR",
            "level": 2,
            "header": 1,
            "entries": [
                "At 2nd level, you may Wild Shape into a beast with a swimming speed and a maximum challenge rating of 1/4. You also gain a swimming speed equal to your walking speed in your normal form.",
                "If you know the cantrip druidcraft, you may cast it as a bonus action but only on the same turn as you use your action to transform into your Wild Shape. You also gain the following optional effects for druidcraft:",
                {
                    "type": "list",
                    "items": [
                        "You instantly create a harmless sensory effect such as the scent of ocean spray, a blast of freezing air, the rolling rumble of distant thunder or pouring rain, or a faint blue flash of electricity. The effect must fit in a 5-foot cube.",
                        "You instantly dry, drench, thaw, or freeze an object no larger than 1 cubic foot. Unless kept at subzero temperature, an object you freeze thaws by the beginning of your next turn, at which point it is drenched. A submerged object that is neither worn nor carried when frozen is encased in ice for one round and rises 60 feet toward the surface of the water before it thaws."
                    ]
                }
            ]
        },
        {
            "name": "Riding the Storm",
            "source": "CotSR",
            "className": "Druid",
            "classSource": "PHB",
            "subclassShortName": "Storm Rider",
            "subclassSource": "CotSR",
            "level": 2,
            "header": 1,
            "entries": [
                "Starting at 2nd level, you gain 2 capabilities from the list below. You gain Unarmored Defense and one other capability of your choice. You gain one additional capability of your choice at 6th, 10th, and 14th level. Some capabilities require you to have a minimum druid level in order to gain it.",
                "Furthermore, each time you gain a level, you can replace any one capability with a new one you qualify for. You can only use these capabilities while in Wild Shape form or while not wearing armor nor wielding a shield.",
                "Some capabilities can only be used while in Wild Shape.",
                {
                    "type": "options",
                    "count": 2,
                    "entries": [
                        {
                            "type": "refOptionalfeature",
                            "optionalfeature": "Unarmored Defense|CotSR",
                            "name": "Unarmored Defense"
                        },
                        {
                            "type": "refOptionalfeature",
                            "optionalfeature": "Step of the Wind|CotSR",
                            "name": "Step of the Wind"
                        },
                        {
                            "type": "refOptionalfeature",
                            "optionalfeature": "Primal Ferocity|CotSR",
                            "name": "Primal Ferocity"
                        },
                        {
                            "type": "refOptionalfeature",
                            "optionalfeature": "Strike of the Rolling Wave|CotSR",
                            "name": "Strike of the Rolling Wave"
                        },
                        {
                            "type": "refOptionalfeature",
                            "optionalfeature": "Evasive Speed|CotSR",
                            "name": "Evasive Speed"
                        },
                        {
                            "type": "refOptionalfeature",
                            "optionalfeature": "Reckless Attack|CotSR",
                            "name": "Reckless Attack"
                        },
                        {
                            "type": "refOptionalfeature",
                            "optionalfeature": "Deflect Missiles|CotSR",
                            "name": "Deflect Missiles"
                        },
                        {
                            "type": "refOptionalfeature",
                            "optionalfeature": "Favorable Wind|CotSR",
                            "name": "Favorable Wind"
                        },
                        {
                            "type": "refOptionalfeature",
                            "optionalfeature": "Swift Movement|CotSR",
                            "name": "Swift Movement"
                        },
                        {
                            "type": "refOptionalfeature",
                            "optionalfeature": "Stunning Circle Spell|CotSR",
                            "name": "Stunning Circle Spell"
                        },
                        {
                            "type": "refOptionalfeature",
                            "optionalfeature": "Command of the Elements|CotSR",
                            "name": "Command of the Elements"
                        },
                        {
                            "type": "refOptionalfeature",
                            "optionalfeature": "Relentless Wild Shape|CotSR",
                            "name": "Relentless Wild Shape"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Beast of the Storm Cloud",
            "source": "CotSR",
            "className": "Druid",
            "classSource": "PHB",
            "subclassShortName": "Storm Rider",
            "subclassSource": "CotSR",
            "level": 6,
            "header": 1,
            "entries": [
                "Starting at 6th level, you can Wild Shape into any beast of challenge rating of 1/2 or lower, including beasts with a flying speed. If you know the cantrip druidcraft you may cast it while in Wild Shape."
            ]
        },
        {
            "name": "Beast of the Whirlwind",
            "source": "CotSR",
            "className": "Druid",
            "classSource": "PHB",
            "subclassShortName": "Storm Rider",
            "subclassSource": "CotSR",
            "level": 10,
            "header": 1,
            "entries": [
                "At 10th level while in Wild Shape, you can use your action to expend any 1 spell slot and change your beast form into a new form with a maximum challenge rating equal to 1 + the level of the spell slot expended. When you transform, as part of your action you may also choose a number of creatures you can see equal to the spell slot level you used. Those creatures can communicate with you normally while you are in beast form.",
                "For instance, you can expend a level 9 spell slot and transform into a beast with a maximum challenge rating of 10 and can communicate with up to 9 creatures of your choice you could see when you transformed.",
                "Additionally, when you use your action to transform into a beast, you can use your bonus action to expend spell slots for an improved Wild Shape on the same turn. You can only use your bonus action in this way on the same turn that you use your action to transform into your Wild Shape from your normal form."
            ]
        },
        {
            "name": "Weather Resilience",
            "source": "CotSR",
            "className": "Druid",
            "classSource": "PHB",
            "subclassShortName": "Storm Rider",
            "subclassSource": "CotSR",
            "level": 14,
            "header": 1,
            "entries": [
                "You have resistance to cold, thunder, and lightning damage in any form at 14th level. Furthermore, if you fail a saving throw to maintain concentration on a spell when damaged by cold, thunder, and lightning, you can use your reaction to reroll the saving throw. You cannot use this aspect again until you have finished a short or long rest."
            ]
        }
    ]
}
